{"title": "Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Your browser does not support iframes, but you can use the following link. Link Fullscreen", "source_url": "https://www.mosdac.gov.in/", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.025421"}}
{"title": "", "type": "general", "section": "Land Surface", "text": "{{appNameDisplay}} {{startEndDateStr}} Time Series Longitude : Latitude : Start Date: End Date: Submit {{timezone}} {{generalMessage.infoMsg.noLegends.message1}} Close Legends", "source_url": "https://www.mosdac.gov.in/internal/soil-wetness", "document_type": "static", "meta": {"tags": [], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.034729"}}
{"title": "Meteorological Oceanographic Satellite Data Archival Centre", "type": "product", "section": "Satellite Data", "text": "Your browser does not support iframes, but you can use the following link. Link Fullscreen", "source_url": "https://www.mosdac.gov.in/node?qt-latest_products=3#qt-latest_products", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.035817"}}
{"title": "", "type": "general", "section": "Cyclone", "text": "{{applicationName}} {{selectedTimezone}} {{datetimeLoc}} {{datetimeGmt}} Year: Cyclone: {{layergrps.values_.title}} Selection:- Single Multiple {{layers.values_.title}} Select Date And Time : --Select-- Analyzed Winds Observed Winds {{layers.values_.extraparams.selectedTimeObj.sensorSatellite}} TIR1 Count TIR2 Count MIR Count SWIR Count Visible Count Water Vapour Count Quick Layers Analysis Tools Legends Gfs Winds SCAT Image Cyclone Info {{item.label}} {{item.label}} Close Close Close Close SCORPIO (Satellite Based Cyclone Observation and Real-time Prediction over Indian Ocean) is a WebGIS based Cyclone Information System. Accurate and timely advance prediction of tropical cyclones is very important to disseminate the warnings and preparedness. Prediction of development of any cyclone system in the North Indian Ocean is being done at Space Applications Centre (ISRO) Ahmedabad, using the in-house developed algorithms. Once the low-pressure system is formed, it is continuously monitored by satellite observations. The forecasts like cyclogenesis, track, intensity and landfall of cyclones, ship avoidance region, storm surge, coastal inundation etc. and satellite based cyclone information are disseminated through web-portal SCORPIO. This is an experimental forecast. This information is to be used along with other reliable data sources for interpretation. SAC/ISRO/MOSDAC should not be made responsible for any loss or damage incurred. The information is provided on best effort basis and while we endeavor to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the absolute accuracies of information, data products, services, or related graphics contained on the website for any purpose unless and until explicitly mentioned. In no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website. The maps are only for gross indication of locations. Every effort is made to keep the website up and running smoothly. However, we take no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control. Developed Maintained By: DWD/SAC/ISRO. Credits for following information/layers/data used in this website is dually acknowledged Bhuvan Layer: NRSC, Hyderabd (www.nrsc.gov.in) OpenStreetMap: OpenStreetMap Contributors (www.openstreetmap.org/copyright) True Marble: Unearthed Outdoors, LLC India River Basins/ State/ District Boundaries and World Coastlines : India Meteorological Department, Delhi (www.imd.gov.in) FORECAST Data : AOSG/SAC Close Close", "source_url": "https://www.mosdac.gov.in/internal/cyclone", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "ocean", "imagery", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.039802"}}
{"title": "OCEANSAT-3 Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "EOS-06(Oceansat-3) also known as Earth Observing Satellite EOS-06(Oceansat-3) , was launched by PSLV-C54 from Satish Dhawan Space Centre, Sriharikota on 26 November 2022. EOS-06(Oceansat-3) is developed to provide a unique opportunity for simultaneously measuring the physical, biological and atmospheric parameters for the first time from three instruments, (i) 13-band advanced Ocean Colour Monitor (OCM-3), (ii) Ku-band Scatterometer (SCAT-3) and (ii) a 2-channel Sea Surface Temperature Monitor (SSTM). ARGOS is the fourth payload provided by French Space Agency (CNES) and serves as a data collection platform from various ocean based platform. EOS-06(Oceansat-3) is envisaged to provide continuity of operational services of Oceansat-1, 2 and SCATSAT-1 Mission with enhanced application potential. ह न द", "source_url": "https://www.mosdac.gov.in/oceansat-3", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.041631"}}
{"title": "", "type": "general", "section": "General", "text": "{{applicationName}} Rainfall (mm): {{datetime}} GMT Current HeavyRain {{layergrps.values_.title}} Selection:- Single Multiple {{layers.values_.title}} {{layers.values_.extraparams.selectedTimeObj.sensorSatellite}} Previous Forecast/Events Select Date: Select Time(GMT): Submit Tools Analysis Legends {{generalMessage.infoMsg.toolsNoBtn.message}} {{generalMessage.infoMsg.analysisNoBtn.message}} {{generalMessage.infoMsg.noLegends.message1}} DISTRICTS HAVING HIGH RAIN( 5mm/h) District Name Met-subdivision Rain(mm/h) {{item1}} AREA HAVING HIGH RAIN( 10mm/h) Area(Km 2) Highest Rain(mm/h) Lat/Long {{item1_t2}} Close DISTRICTS HAVING HIGH RAIN( 5mm/h) District Name Met-subdivision Rain(mm/h) {{item1}} AREA HAVING HIGH RAIN( 10mm/h) Area(Km 2) Highest Rain(mm/h) Lat/Long {{item1_t2}} Close For More Detail... Algorithm Space Applications Centre, ISRO Developed Maintained By: DWD/SAC Credits for following information/layers/data used in this website is dually acknowledged OpenStreetMap: OpenStreetMap Contributors (www.openstreetmap.org/copyright) True Marble: Unearthed Outdoors, LLC India River Basins/ State/ District Boundaries and World Coastlines : India Meteorological Department, Delhi (www.imd.gov.in) INSAT 3D Algorithm : AOSG/SAC Close", "source_url": "https://www.mosdac.gov.in/internal/event-heavyrain", "document_type": "static", "meta": {"tags": ["rainfall", "satellite", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.045168"}}
{"title": "About Us Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Space Applications Centre (SAC) is an ISRO Centre located at Ahmedabad, dealing with a wide variety of themes from satellite payload development, operational data reception and processing to societal applications. SAC is responsible for the development, realization and qualification of communication, navigation, earth observation and planetary payloads and related data processing and ground systems in the areas of communications, broadcasting, remote sensing and disaster monitoring / mitigation. Meteorological and Oceanographic Satellite Data Archival Centre (MOSDAC) is a Data Centre of Space Applications Centre (SAC) and has facility for satellite data reception, processing, analysis and dissemination. MOSDAC is operationally supplying earth observation data from Indian meteorology and oceanography satellites, to cater to national and international research requirements.", "source_url": "https://www.mosdac.gov.in/about-us", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.047287"}}
{"title": "Privacy Policy Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "This Policy outlines the types of information we gather about you and how we use it. We understand that your personal information is very sensitive, and protecting the privacy of this information is a top priority for us. All the information collected by this site will be kept strictly confidential. We do not rent, sell or share your personal information with any other third party. We will not disclose your personal information with any other third party unless: To help investigate, prevent or take action regarding unlawful and illegal activities, suspected fraud, potential threat to the safety or security of any person, violations of http://www.mosdac.gov.in terms of use or to defend against legal claims. Special circumstances such as compliance with subpoenas, court orders, requests/order from legal authorities or law enforcement agencies requiring such disclosure. If we ever change the Privacy Policy, we will post that information on this page. If you have any questions about http://www.mosdac.gov.in Privacy Policy, please e-mail us at admin[at]mosdac[dot]gov[dot]in. ह न द", "source_url": "https://www.mosdac.gov.in/privacy-policy", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.049656"}}
{"title": "Inland Water Height Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "It is crucial to know how the storage of inland water bodies change over time. Also, hydrological modelling studies face the challenge of decreasing availability of in-situ monitoring data. However, application of satellite radar altimetry over the inland water bodies becomes vital tool to estimate water levels through waveform retracking on satellite altimetry?s sensor data. SARAL-Altika was launched on 25 February 2013. It is a joint-mission of CNES France and ISRO to provide continuous monitoring of ocean and continental water surface. It was launched into a Sun synchronous polar orbit at an altitude of 790km with 35 days of orbit repetition and follows same ground track as ENVISAT satellite. It has 98.55 deg of inclination with 75 km of equatorial cross track separation. It has Ka-band (35.75 GHz) radar altimeter. Water level product for inland water bodies (presently for Brahmaputra river and Ukai Reservoir) has been generated using the SARAL-ALTIKA waveform data. Data Access Click Here to access the Science Products . Request to use MOSDAC Single Sign On user credentials to download the data. Data Version Version 1.0 (beta) Data Sources Altimeter Interim Geophysical Data Record (IGDR) Geophysical Data Record (GDR) ECMWF Pressure Fields Global Ionosphere Maps (GIM) produced Total Electron Content (TEC) maps Processing Steps Firstly the waveforms are classified based on their signature, and then these waveforms are retracked with the suitable retracker. Dedicated inland range correction algorithms are required to account for the atmospheric delays.Detailed information about the processing can be found in (S. Chanderet. al. 2014, A .Dubey et. al. 2014). References S. Chander, and P Chauhan (2013). Algorithm Theoretical BasisDocument for SARAL/AltiKa data processing for geophysical parametersretrieval, scientific report no. EPSA/MPSG/PMD/2013/01. S Chander, D Ganguly, AK Dubey, PK Gupta, RP Singh and P Chauhan(2014).Inland water bodies monitoring using satellite altimetry overIndian region, The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences, Volume XL-8, 2014, ISPRS Technical Commission VIII Symposium, 09 ? 12 December 2014, Hyderabad, India. A K Dubey, P K Gupta, S Dutta and R P Singh (2015). Water Level Retrieval using SARAL/AltiKa Observations in the Braided Brahmaputra River, Eastern India, Marine Geodesy, DOI: 10.1080/01490419.2015.1008156 D Ganguly, S Chander, S Deasi and P Chauhan. Optimal waveform retracker for inland water bodies: A case study over Ukai Dam/Reservoir, is under review in the journal of Marine Geodesy. P K Gupta, A K Dubey, N Goswami, R P Singh and P Chauhan (2015): Use of SARAL/AltiKa Observations for Modeling River Flow. Marine Geodesy (accepted). Derivation Techniques and Algorithm The water level over the inland water bodies can be retrieved using altimeter waveforms data. The range information is estimated based on the arrival time of the radar pulse. This range is then corrected for Dry tropospheric correction, wet tropospheric correction, ionospheric correction, and tidal correction, i.e. Load tide, solid earth tide. Detailed information about the range corrections can be found in the ATBD document (S. Chander and Prakash Chauhan, 2013) of the SARAL mission. Limitations Based on the availability of the Altimeter dataset over the study region (Data Gap, altimeter track loss, bad weather, etc.). Known problems with data Data problems due to bad weather (heavy rain) Related data collections GPS Field trip for water level measurement was conducted over Ukai reservoir on 9th November 2013, 17th January 2014 and 2nd January 2015. Brahmaputra observed river water level data was collected for 6 locations from upstream to downstream from Inland Waterways Authority (IWAI) and Central Water Commission (CWC) along with the satellite pass synchronous field trips. File Naming Convention altimeter_derived_water_height_ukai_yyyymmdd_v1 MetaData Sr. No Core Metadata Elements Definition 1 Metadata language English 2 Metadata Contact MOSDAC 3 Metadata date March 05, 2015 4 Data Lineage or Quality Water height estimation over inland water bodies using radar altimeters 5 Title Inland Water Bodies Monitoring using Satellite Altimetry over Indian Region 6 Abstract Inland water bodies? heightshave been estimated using SARAl-Altika and Jason-2 data over the two test sites, i.e. Ukai reservoir and Brahmaputra River (10 sites from upstream to downstream locations within the Indian region). The results were matched with the in-situ data collected from the GPS field trips and observed data collected from IWAI and CWC. In the first phase results of these two sites are presented herewith. Such 29 inland water bodies with (49 locations) are being done in the phase manner 7 Dataset Contact Shard Chander and D Gangulay, PMD/BPSG/EPSA, Praveen Gupta and Amit Dubey, EHD/BPSG/EPSA SAC (ISRO), Ahmedabad-380015, India. Ph: 91 79 2691 4138. Email: pkgupta sac.isro.gov.in ; schander sac.isro.gov.in 8 Update frequency Near real time after the altimeter pass over the study area (35 days repetivity) 9 Access Rights or Restriction Open Access 10 Spatial Resolution NA 11 Language English 12 Topic Category Inland water bodies monitoring 13 Keywords Rivers/reservoirs, Satellite altimetry, waveform retracking, geophysical range corrections, water levels 14 Date or period Since launch of SARAL-Altika (February 2013) 15 Responsible Party Dr.Prakash Chauhan, Biological and Planetary Sciences Group, EPSA, Space Applications Centre (ISRO), Ahmedabad-380015, India 16 Organization Space Applications Centre (ISRO), Ahmedabad, India 16a Org. role Retrieval of water level using Remote sensing techniques 16b Individual name D. Ram Rajak, OSD/AOSG/EPSA, SAC (ISRO), Ahmedabad-380015, India. Ph: 91 79 2691 6051. Email: rajakdr sac.isro.gov.in 16c Position Scientist/Engineer, OSD/AOSG/EPSA, SAC (ISRO), Ahmedabad-380015, India. Ph: 91 79 2691 6051. Email: rajakdr sac.isro.gov.in 16d Vertical Extent (minimumValue, maximumValue, unitOfMeasure, vertical datum) Default value NaN Unitofmeasurement meter Datum: WGS84 17 Geographic Extent UL Coordinates: 40N, 65E. UR Coordinates: 40N, 100E. LL Coordinates: 5, 65E. LR Coordinates: 5, 100E. 18 Geographic name, geographic Identifier Indian Region 19 Bounding box UL Coordinates: 40N, 65E. UR Coordinates: 40N, 105E. LL Coordinates: 5, 65E. LR Coordinates: 5, 105E. 20 Temporal Extent Historical time series plot of water heights over inland water body since the availability of altimeter measurement 21 Access Rights or Restrictions Open Access 22 Distribution Information Online download in text, and PNG formats 23 Processing Level Level 3 (Data product derived from altimeter IGDR/GDR product) 24 Reference System Datum: WGS84 Tags: Opendata Land", "source_url": "https://www.mosdac.gov.in/inland-water-height", "document_type": "static", "meta": {"tags": ["rainfall", "temperature", "satellite", "ocean", "climate", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.057090"}}
{"title": "Oceansat-2 Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Oceansat-2 satellite mainframe systems derive their heritage from previous IRS missions. Oceansat-2 was launched by PSLV-C14 from Satish Dhawan Space Centre, Sriharikota on Sept. 23, 2009. It carries three payloads: Ocean Colour Monitor (OCM) Ku-band Pencil Beam scatterometer (SCAT) developed by ISRO Radio Occultation Sounder for Atmosphere (ROSA) developed by the Italian Space Agency. Oceansat-2 is envisaged to provide continuity of operational services of Oceansat-1(IRS-P4) with enhanced application potential. ह न द", "source_url": "https://www.mosdac.gov.in/oceansat-2", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.058821"}}
{"title": "SCATSAT-1 Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Scatsat-1 was launched by PSLV-C35 from Satish Dhawan Space Centre, Sriharikota on September 26, 2016. It carries the Ku-band Pencil Beam scatterometer (SCAT) payload developed by SAC-ISRO. ह न द", "source_url": "https://www.mosdac.gov.in/scatsat-1", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.060048"}}
{"title": "Meteorological Oceanographic Satellite Data Archival Centre", "type": "product", "section": "Satellite Data", "text": "Your browser does not support iframes, but you can use the following link. Link Fullscreen", "source_url": "https://www.mosdac.gov.in/node?qt-latest_products=0#qt-latest_products", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.061079"}}
{"title": "Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Your browser does not support iframes, but you can use the following link. Link Fullscreen", "source_url": "https://www.mosdac.gov.in/#main-content", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.067232"}}
{"title": "MOSDAC Feedback Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Detailed feedback can be sent to Web Information Manager/ Administrator at Contact Page Are you a registered user of MOSDAC? Yes No Type of use Frequent Optional Purpose of using the data Operational Research Informational How would you grade overall design of website Needs Improvement Good Excellent How would you grade the data ordering interface of website Needs Improvement Good Excellent Email ID Enter your valid Email Id Comments Math question 4 14 Solve this simple math problem and enter the result. E.g. for 1 3, enter 4.", "source_url": "https://www.mosdac.gov.in/mosdac-feedback", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.068983"}}
{"title": "Bayesian based MT-SAPHIR rainfall Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Climate Monitoring", "text": "Megha- Tropiques (MT) is a joint Indo-French collaborative satellite mission, which is launched on 12 October 2011. The main objective of MT is to get more understanding on convective system, energy exchange and water cycle in the tropical region. It is equipped with Microwave Analysis and Detection of Rain and Atmospheric Structures (MADRAS) (not in operational), Scanner for Radiation Budget, Radio Occultation Sensor for Atmosphere and Sondeur Atmospherique du Profil d'Humidite Intertropical par Radiometrie (SAPHIR). SAPHIR provides clear sky atmospheric humidity profiles at 6-channels near 183.31GHz water vapour resonance. The observations of SAPHIR provides an opportunity to estimate rainfall using 183.31GHz channels. A Bayesian based rainfall retrieval technique is developed using SAPHIR channel-6 (183.31 11GHz) brightness temperature observations. Estimated rainfall has been validated with IMERG and DPR products during Jan-Dec 2017. The global distribution of rainfall patterns are captured well by the estimation. Data Access Click Here to access the Science Products. Request to use MOSDAC Single Sign On user credentials to download the data. Data Version Version 1.1 (beta) Data Sources SAPHIR Level 1A TB data Processing Steps SAPHIR Level-1 brightness temperature of channel-6 (Tb6) and spatial variability of Tb6 (Std-tb6) within 3 pixels ( 30km at nadir and 60km off nadir) is calculated. Bayesian algorithm is trained using GPM-IMERG half hourly rainfall Bayesian approach is applied to estimate rainfall from SAPHIR sounder observations. References Kummerow, C.D., W. S. Olson, and L. Giglio, A simplified scheme for obtaining precipitation and vertical hydrometeor profiles from passive microwave sensors, IEEE Trans. Geosci. Remote Sens., vol. 34, no. 5, pp. 1213 1232, Sep. 1996. Pierdicca, N., F. S. Marzano, G. D'Auria, P. Basili, P. Ciotti, and A. Mugnai, Precipitation retrieval from spaceborne microwave radiometers using maximum a posteriori probability estimation, IEEE Trans. Geosci. Remote Sens., vol. 34, no. 4, pp. 831 846, Jul. 1996. Olson, W.S., C. D. Kummerow, G. M. Heymsfield, and L. Giglio, A method for combined passive-active microwave retrievals of cloud and precipitation parameters, J. Appl. Meteorol., vol. 35, pp. 1763 1789, 1996. Marzano, F.S., A. Mugnai, G. Panegrossi, N. Pierdicca, E. A. Smith, and J. Turk, Bayesian estimation of precipitating cloud parameters from combined measurements of spaceborne microwave radiometer and radar, IEEE Trans. Geosci. Remote Sens., vol. 37, no. 1, pp. 596 613, Jan. 1999. Viltard, N., C. Burlaud, and C. D. Kummerow, Rain retrieval from TMI brightness temperature measurements using a TRMM PR based database. J. Appl. Meteor. Climatol, 45, 455 466, doi:10.1175/JAM2346.1, 2006. Gopalan, K., N.-Y. Wang, R. Ferraro, and C. Liu, Status of the TRMM 2A12 land precipitation algorithm. J. Atmos. Oceanic Technol., 27, 1343 1354, doi:10.1175/2010JTECHA1454.1, 2010. Derivation Techniques and Algorithm User should refer report \"Rainfall Estimation from Megha-Tropiques Microwave Sounder-SAPHIR using Bayesian Approach\" for complete reference to the algorithm. Limitations Rainfall estimates are not provided in the 3 outermost scan positions of the SAPHIR scan. Known problems with data No known issues at this time. File Naming Convention HDF5 file: MTSAPS__VVV_ _YYYY_MM_DD_ .Bayesian_RR.h5 VVV is the Level 1 version number YYYY is the year, MM is the month and DD is the date of the orbit. MetaData Sr. No Core Metadata Elements Definition 1 Metadata language English 2 Metadata Contact MOSDAC 3 Metadata date June 2018 4 Data Lineage or Quality Rain Rate 5 Title Bayesian based MT-SAPHIR rainfall 6 Abstract Megha- Tropiques (MT) is a joint Indo-French collaborative satellite mission, which is launched on 12 October 2011. The main objective of MT is to get more understanding on convective system, energy exchange and water cycle in the tropical region. It is equipped with Microwave Analysis and Detection of Rain and Atmospheric Structures (MADRAS) (not in operational), Scanner for Radiation Budget and Radio Occultation Sensor for Atmosphere and Sondeur Atmospherique du Profil d'Humidite Intertropical par Radiometrie (SAPHIR). SAPHIR provides clear sky atmospheric humidity profiles at 6-channels near 183.31GHz water vapour resonance. The observations of SAPHIR provides an opportunity to estimate rainfall using 183.31GHz channels. A Bayesian based rainfall retrieval technique is developed using SAPHIR channel-6 (183.31 11GHz) brightness temperature observations. Estimated rainfall has been validated with IMERG and DPR products during Jan-Dec 2017. The global distribution of rainfall patterns are captured well by the estimation. 7 Dataset Contact Neerja Sharma and Kaushik Gopalan, GRD/AOSG/EPSA, Space Applications Centre (ISRO), Ahmedabad, 380015, kaushikg sac.isro.gov.in 8 Update Frequency January 2017 to May 2018 have been processed. Data will be updated daily with 24 hours lag. 9 Access Rights or Restriction Open Access 10 Spatial Resolution Data is provided at native spatial resolution of the SAPHIR instrument. 11 Language English 12 Topic Category Rainfall 13 Keywords Microwave sounder, Bayesian technique, rainfall 14 Date or period From January 2017 onwards. 15 Responsible Party Neerja Sharma and Kaushik Gopalan,GRD/AOGG/ EPSA, Space Applications Centre (ISRO), Ahmedabad-380015, India 16 Organization Space Applications Centre (ISRO), Ahmedabad, India 16a Org. role Rainfall retrieval from MT-SAPHIR observations 16b Individual name Neerja Sharma, GRD/AOSG/EPSA, SAC(ISRO), Ahmedabad-380015, India. Ph: 91 79 26916115. Email: neerjasharma sac.isro.gov.in Kaushik Gopalan, GRD/AOSG/EPSA, SAC (ISRO), Ahmedabad-380015, India. Ph: 91 79 2691 6110. Email: kaushikg sac.isro.gov.in 16c Position Scientist/Engineer, GRD/AOSG/EPSA, SAC (ISRO), Ahmedabad-380015 16d Vertical Extent (minimumValue, maximumValue, unitOfMeasure, vertical datum) NA 17 Geographic Extent Tropical region (28S to 28N) 18 Geographic name, geographic Identifier lat_min: 28S, lat_max: 28N, lon_min: 0, lon_max: 360 19 Bounding box lat_min: 28S, lat_max: 28N, lon_min: 0, lon_max: 360 20 Temporal Extent January 2017 onwards 21 Access Rights or Restrictions Open Access 22 Distribution Information Online download of data files in HDF5 format 23 Processing Level Level 2 (Data product derived from MT SAPHIR) 24 Reference System Datum: WGS84 Tags: Opendata Atmosphere", "source_url": "https://www.mosdac.gov.in/bayesian-based-mt-saphir-rainfall", "document_type": "static", "meta": {"tags": ["rainfall", "temperature", "satellite", "ocean", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.080841"}}
{"title": "Soil Moisture Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Data Access Click Here to access the Science Products . Request to use MOSDAC Single Sign On user credentials to download the data. Data Version Version 1.0 (beta) Data Sources SMAP L-band radiometer data Processing Steps Following are the three major processing steps : i. SMAP L1C daily data. ii. Import previous 3 days data iii. Generate global mosaic of Tb iv. Generate Indian mosaic of Tb v. Generate SWI from Tb and gridding the data Derivation Techniques and Algorithm Soil Wetness Index (SWI) is derived using a time series based methodology using SMAP L-band radiometer data, normalized to the extreme values of 0 and 1, corresponding to the dry and saturated soil wetness conditions respectively. File Naming Convention The Geotiff file names follows naming convention; Soil Wetness Index file: SWI_SMAP_I_YYYYMMD1_YYYYMMD2.tif SWI : Soil Wetness Index SMAP : Soil Moisture Active Passive I : India YYYY : Year MM : Month D1 : Start Date D2 : End Date Soil Moisture file : SWI_SMAP_I_YYYYMMD1_YYYYMMD2.tif SWI : Soil Moisture SMAP : Soil Moisture Active Passive I : India YYYY : Year MM : Month D1 : Start Date D2 : End Date MetaData Sr. No Core Metadata Elements Definition 1 Metadata language English 2 Metadata Contact MOSDAC 3 Metadata date April, 2015 4 Data Lineage or Quality Soil Wetness Map derived using SMAP L-band Radiometer data 5 Title Soil Wetness Index. 6 Abstract Soil Wetness Index (SWI) is derived using a time series based methodology using SMAP L-band radiometer data, normalized to the extreme values of 0 and 1, corresponding to the dry and saturated soil wetness conditions respectively. 7 Dataset Contact Dharmendra Kumar Pandey, Sasmita Chaurasia, EPSA, Space Applications Centre (ISRO), Ahmedabad-380015, dkp sac.isro.gov.in , sasmita sac.isro.gov.in 8 Update frequency 3 day composite 9 Access Rights or Restriction Open Access 10 Spatial Resolution 40 km (resampled at 0.125 degrees) 11 Language English 12 Topic Category Land 13 Keywords Soil Wetness Index, SMAP. SWI, Soil Moisture Active Passive 14 Date or period April 2015 15 Responsible Party Dharmendra Kumar Pandey,EPSA, Space Applications Centre (ISRO), Ahmedabad-380015, India 16 Organization Space Applications Centre (ISRO), Ahmedabad, India 16a Org. role Geophysical parameters retrieval from satellite 16b Individual name Dharmendra Kumar pandeyEPSA, SAC (ISRO), Ahmedabad-380015, India. Ph: 91 79 2691 4005. Email: dkp sac.isro.gov.in 16c Position Scientist/Engineer, EPSA, SAC (ISRO), Ahmedabad-380015, India. Ph: 91 79 2691 4005. Email: dkp sac.isro.gov.in 17 Geographic Extent Indian Land mask 18 Geographic name, geographic Identifier Indian Region 19 Bounding box lat_min: 05N, lat_max: 24N, lon_min: 68E, lon_max: 90E 20 Temporal Extent April 2015 onwards 21 Access Rights or Restrictions Open Access 22 Distribution Information Online download in Geotiff format. 23 Processing Level Level 2 24 Reference System Datum: WGS84 Tags: Opendata Land", "source_url": "https://www.mosdac.gov.in/soil-moisture-0", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.084938"}}
{"title": "Sea Ice Occurrence Probability Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "The Sea Ice Occurrence Probability (SIOP36) data were prepared from 36 years (October 1978 to December 2014) NSIDC sea ice concentration (SIC) data over the Antarctic Region (Cavalieri, 1996). The SIC data were downloaded from NSIDC data site:( http://nsidc.org/data (link is external)). The SIOP36 data consist of 366 data files corresponding to 366 days with the first file representing 1st January and the last, 31st December. The file naming nomenclature follows SIOP36_MMDD_S.bin[.tif/.png] format; where MM refers to month number (01 to 12, 01 being January), DD refers to date of the month, and the character S refers to Southern Hemishphere. Data formats are indicated by .bin (Binary), .tif (GeoTIFF), and .png (Portable Network Graphics). Data is freely available to global scientific community and can be downloaded from www.mosdac.gov.in (link is external). Probability values are calculated from the long-term NASA Team algorithm-derived SMMR-SSM/I-SSMIS sea ice concentration product (Cavalieri, 1996). The dataset is given in Polar Stereographic projection with a grid size of 25km x 25km in latitude and longitude. The grid coordinates of the upper left pixel are 39.2 deg S, 42.2 deg W. There are 316 columns and 332 rows. Data values are stored as IEEE floats representing probabilities in the range 0-100 . Pixels with zero values corresponds to either Antarctic land/ice or ocean water. Data Access Click Here to access the Science Products . Request to use MOSDAC Single Sign On user credentials to download the data. Data Version SIOP36 (ver BETA) Data Sources The major input data is NASA Team algorithm-derived SMMR-SSM/I-SSMIS sea ice concentration data over Antarctic Region (Cavalieri, 1996) for 36 years (October 1978 to December 2014). The data was downloaded from NSIDC data site: ( http://nsidc.org/data ). Processing Steps Following are the three major processing steps : i. Classification of pixels into sea-ice and non-sea-ice classes. ii. Determination of sea-ice-pixel frequency over study period iii. Calculation of Sea Ice Probability iv. Converting the data into three (.bin, .tif, and .png) formats. Data Citation Data Citation This dataset may be cited as (Rajak et al, 2015). Rajak D. Ram, R.K. Kamaljit Singh, Jayaprasad P., Sandip R. Oza, Rashmi Sharma, and Raj Kumar (2015). Sea Ice Occurrence Probability Data and Its Applications Over the Antarctic. Manuscript submitted to a journal. References Cavalieri, D. J., C. L. Parkinson, P. Gloersen, and H. Zwally. 1996, updated yearly. Sea Ice Concentrations from Nimbus-7 SMMR and DMSP SSM/I-SSMIS Passive Microwave Data. [October 1978 to December 2012]. Boulder, Colorado USA: NASA National Snow and Ice Data CentreDistributed Active Archive Centre. References This dataset may be cited as (Rajak et al, 2015). Comiso, J. C. 2000, updated 2014. Bootstrap Sea Ice Concentrations from Nimbus-7 SMMR and DMSP SSM/I-SSMIS. Version 2. [October 1978 to December 2012]. Boulder, Colorado USA: NASA DAAC at the National Snow and Ice Data Center. Rajak D. Ram, R.K. Kamaljit Singh, Jayaprasad P., Sandip R. Oza, Rashmi Sharma, and Raj Kumar (2015). PROBABILISTIC SEA ICE OCCURRENCE DATA OVER ANTARCTIC REGION. Manuscript under preparation. Derivation Techniques and Algorithm Daily Probability of occurrence of sea ice: Pr 100 x N / (Y-n) where, N, is the number of times the pixel has been classified as sea ice (sea ice concentration 15 ); Y, is the total possible observations, and n is the number of years with data loss on that particular date. Limitations Accuracy assessment of the dataset has not been carried out. Known problems with data The inherent problems of the major input sea ice concentration data (from NSIDC site) may be considered the problems with this dataset. Related data collections Northern Hemisphere EASE-Grid 2.0 Weekly Snow Cover and Sea Ice Extent. Version 4. Boulder, Colorado USA: NASA DAAC at the National Snow and Ice Data Center (Brodzik, M. and R. Armstrong. 2013.). [ http://nsidc.org/data ]. File Naming Convention The file names follows SIOP36_MMDD_S.bin[.tif/.png] naming convention; Where MM refers to month number (01 to 12, 01 being January), DD refers to date of the month, and S refers to Southern Hemisphere. Data types are indicated by .bin (binary), .tif (geotiff), and .png (portable network graphics). MetaData Sr. No Core Metadata Elements Definition 1 Metadata language English 2 Metadata Contact D. Ram Rajak, OSD/AOSG/EPSA, Space Applications Centre (ISRO), Ahmedabad-380015, India. Email: rajakdr sac.isro.gov.in 3 Metadata date March 05, 2015 4 Data Lineage or Quality First ever sea ice occurrence probability data available over the Antarctic 5 Title Sea Ice Occurrence Probability Data over the Antarctic (SIOP36). 6 Abstract Antarctic Sea Ice Occurrence Probability (SIOP) for each day from January 1st to December 31st is generated from NSIDC sea ice concentration data (Comiso, 2000) which were downloaded from the NSIDC site: ( http://nsidc.org/data ). The SIOP data for 36 years (October 1978 to December 2014) are named as SIOP36 7 Dataset Contact D. Ram Rajak, OSD/AOSG/EPSA, SAC (ISRO), Ahmedabad-380015, India. Ph: 91 79 2691 6051. Email: rajakdr sac.isro.gov.in 8 Update frequency 3 years 9 Access Rights or Restriction Open Access 10 Spatial Resolution 25 000 m 11 Language English 12 Topic Category Polar Science 13 Keywords Sea Ice, Probability, the Antarctic 14 Date or period January 01 to December 31 Sea Ice Occurrence Daily Probability calculated from October 1978 to December 2014 data 15 Responsible Party D. Ram Rajak, R. K. Kamaljit Singh, Jayaprasad P., Sandip R. Oza, Rashmi Sharma, and Raj Kumar, Space Applications Centre (ISRO), Ahmedabad-380015, India 16 Organization Space Applications Centre (ISRO), Ahmedabad, India 16a Org. role Calculated Sea Ice Occurrence Probability (SIOP) for each day from January 1st to December 31st using NSIDC sea ice concentration data (Comiso, 2000). Further details are available in Rajak et al, 2015 16b Individual name D. Ram Rajak, OSD/AOSG/EPSA, SAC (ISRO), Ahmedabad-380015, India. Ph: 91 79 2691 6051. Email: rajakdr sac.isro.gov.in 16c Position Scientist/Engineer, OSD/AOSG/EPSA, SAC (ISRO), Ahmedabad-380015, India. Ph: 91 79 2691 6051. Email: rajakdr sac.isro.gov.in 16d Vertical Extent (minimumValue, maximumValue, unitOfMeasure, vertical datum) Probability in percentage. Minimum value 0.0294 . Maximum value 100.0 . Mask: Antarctica land/ice and open ocean water (value 0.0) 17 Geographic Extent UL Coordinates: 40S, 42W. UR Coordinates: 40S, 42E. LL Coordinates: 42S, 135W. LR Coordinates: 42S, 135E 18 Geographic name, geographic Identifier Ocean surrounding Antarctica 19 Bounding box UL Coordinates: 40S, 42W. UR Coordinates: 40S, 42E. LL Coordinates: 42S, 135W. LR Coordinates: 42S, 135E. Number of columns i. e. image width: 316 pixels. Number of Rows i.e. Image Height: 332 pixels 20 Temporal Extent Based on input NSIDC Sea Ice Concentration Data October 1978 to December 2014 21 Access Rights or Restrictions Open Access 22 Distribution Information Online download in Binary, GeoTIFF and PNG formats. Binary and GeoTIFF data in Float format 23 Processing Level Level 4 (Data product derived from sea ice concentration product) 24 Reference System Projection: Polar Stereographic (0.0 E,70.0 S,0.0 m,0.0 m). Datum: WGS84 Tags: Opendata Ocean", "source_url": "https://www.mosdac.gov.in/sea-ice-occurrence-probability", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "ocean", "imagery", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.092270"}}
{"title": "INSAT-3DS Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "INSAT-3DS is identical to INSAT-3D in terms of Sensors and products. INSAT or the Indian National Satellite System is a series of multipurpose Geo-stationary satellites launched by ISRO to satisfy the telecommunications, broadcasting, meteorology, and search and rescue needs of India. Commissioned in 1983, INSAT is the largest domestic communication system in the Asia Pacific Region. The satellite is monitored and controlled by Master Control Facilities that exist in Hassan and Bhopal. INSAT-3DS is a multipurpose geosynchronous spacecraft with main meteorological payloads (imager and sounder). The main objectives for this mission are to provide an operational, environmental and storm warning system to protect life and property. INSAT3S is monitoring the earth's surface, oceanic observations and also provide data dissemination capabilities. It provides Broadcast Satellite Services (BSS) through two S-band transponders. The data acquisition and processing system is established at Space Applications Centre, Bopal Campus, Ahmedabad, India. The processing of INSAT-3DS data is taken place broadly in four steps. Ground receiving system to receive data Data Reception (DR) system to generate raw data (L0) files Data Processing (DP) system to process L0 data and produce L1B data files (Calibrated and Geo located) Product generation and Dissemination system ह न द", "source_url": "https://www.mosdac.gov.in/insat-3ds", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "imagery", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.100562"}}
{"title": "Log in to MOSDAC Single Sign ON", "type": "general", "section": "Products", "text": "Home (म ख प ष ठ) English Hindi English म स ड क स गल-स इन-ऑन (एसएसओ) MOSDAC Single-Sign-On (SSO) Username or email Password Forgot Password? म स ड क, अ तर क ष उपय ग क द र, इसर , भ रत सरक र द व र न र म त और स च ल त Owned and maintained by MOSDAC, Space Applications Centre, Indian Space Research Organisation, Govt. of INDIA.", "source_url": "https://www.mosdac.gov.in/internal/calval-data", "document_type": "static", "meta": {"tags": ["ocean"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.102492"}}
{"title": "High Resolution Sea Surface Salinity Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "The Bay of Bengal's high-resolution sea surface salinity has been reconstructed using a Lagrangian technique leveraging satellite data. The primary input datasets utilized are sea surface salinity data from the SMAP mission and sea surface currents derived from altimetry. These datasets are obtained at a spatial resolution of 25 km. The SMAP mission has been operational since 2015, whereas altimetry-derived sea surface currents have been available since 1993. Validation of this reconstructed product was conducted against in-situ datasets obtained from thermo-salinographs. Results indicate that the reconstructed product more accurately captures front formation compared to the original SMAP salinity fields. Data Access Science products are available to download with a Single Sign On on MOSDAC. Click Here to access the data Data Version Version 1.0 (beta). Data Sources SMAP Sea Surface Salinity ( https://podaac.jpl.nasa.gov/dataset/SMAP_JPL_L3_SSS_CAP_8DAY-RUNNINGMEAN_V5 ) Altimetry-derived sea surface currents ( https://data.marine.copernicus.eu/product/SEALEVEL_GLO_PHY_L4_MY_008_047/ ). Processing Steps i. Remap Sea Surface Currents with a spatial resolution of 5 km. ii. Backward advection of particles from the final time {t} rsub {f} to the initial time {t} rsub {f} -14 , where 14 is the number of days the particles are advected using Runge-Kutta 4th order method. iii. The SMAP Sea Surface Salinity observed at {t} rsub {f} -14 is interpolated onto the particle positions that day. iv. With this, each particle has an SSS value on {t} rsub {f} day that corresponds to the observation at {t} rsub {f} -14 . References [1] Barbara, B., Drushka, K., Gaube, P. (2021), \"Lagrangian reconstruction to extract small-scale salinity variability from SMAP obervations\", JGR Oceans, 126(3), e2020JC016477. [2] Dencausse, G., Morrow, R., Roge , M., and Fleury, S. (2014). Lateral stirring of large-scale tracer fields by altimetry. Ocean Dynamics, 64(1), 61 78. [3] Despre s, A., Reverdin, G., and d'Ovidio, F. (2011). Mechanisms and spatial variability of mesoscale frontogenesis in the northwestern subpolar gyre. Ocean Modelling, 39(1), 97 113. [4] Durack, P. J., Lee, T., Vinogradova, N. T., and Stammer, D. (2016). Keeping the lights on for global ocean salinity observation. Nature Climate Change, 6(3), 228 231. [5] Lehahn, Y., d'Ovidio, F., and Koren, I. (2018). A satellite-based Lagrangian view on phytoplankton dynamics. Annual Review of Marine Science, 10(1), 99 119. [6] Roge , M., Morrow, R. A., and Dencausse, G. (2015). Altimetric Lagrangian advection to reconstruct Pacific Ocean fine-scale surface tracer fields. Ocean Dynamics, 65(9), 1249 1268. Derivation Techniques and Algorithm The algorithm is called Lagrangian Reconstruction Technique. User should refer [1]. Limitations This algorithm is applicable only in the region with moderate to high eddy kinetic energy and where lateral advection dominates. High resolution sea surface salinity product generated by Lagrangian technique can have error due to tracer bias (depends on accuracy of initial conditions) and advection bias (Passive stirring can introduce bias due to mixing physics (air-sea fluxes, mixing etc.)). Known problems with data Data sets have biases as well as inaccuracy. File Naming Convention Netcdf file: HRSSS_bck_YYYYMMDD_14D.nc MetaData Sr. No Core Metadata Elements Definition 1 Metadata language English 2 Metadata Contact MOSDAC 3 Metadata date April, 2015 4 Data Lineage or Quality High resolution sea surface salinity in Bay of Bengal using Lagrangian technique. 5 Title Dynamic downscaling of Satellite Sea Surface Salinity for the Bay of Bengal 6 Abstract Lagrangian technique is used for generating high-resolution sea surface salinity fields in the Bay of Bengal. This is achieved through the utilization of Sea Surface Salinity (SSS) data derived from the Soil Moisture Active Passive (SMAP) satellite, in conjunction with sea surface currents obtained from altimetry. By employing forward and backward schemes for the numerical advection of SMAP SSS fields using altimeter-derived geostrophic currents, a Lagrangian reconstruction is produced, capturing smaller-scale features. The reliability of our in-house developed algorithm is assessed by comparing it with an available reconstructed product in the Gulf Stream. Additionally, a preliminary validation is conducted against insitu data obtained from a thermo-salinograph. Further, the developed algorithm was modified to select the advection time dynamically. 7 Dataset Contact Jai Kumar, POD/AOSG/EPSA, Space Applications Centre (ISRO), Ahmedabad, 380015, kumarj sac.isro.gov.in 8 Update Frequency Six months. 9 Access Rights or Restriction Open Access 10 Spatial Resolution Spatial resolution is 10 km 11 Language English 12 Topic Category High resolution sea surface salinity product (SAC-TDP) using satellite data. 13 Keywords Sea surface salinity, sea surface currents, Lagrangian advection technique, high resolution 14 Date or period April 2015 - June 2023 15 Responsible Party Jai Kumar, POD/AOGG/ EPSA, Space Applications Centre (ISRO), Ahmedabad-380015, India 16 Organization Space Applications Centre (ISRO), Ahmedabad, India 16a Org. role Geophysical parameters from satellite data in the Bay of Bengal region. 16b Individual name Jai Kumar, POD/AOSG/EPSA, SAC (ISRO), Ahmedabad-380015, India. Ph: 91 79 2691 6104. Email: kumarj sac.isro.gov.in 16c Position Scientist/Engineer, POD/AOSG/EPSA, SAC (ISRO), Ahmedabad-380015 16d Vertical Extent (minimumValue, maximumValue, unitOfMeasure, vertical datum) Lat_min : 0N, Lat_max : 25N, Lon_min: 78E, Lon_max: 100 E 17 Geographic Extent Indian Landmass 18 Geographic name, geographic Identifier Bay of Bengal 19 Bounding box Lat_min : 0N, Lat_max : 25 N, Lon_min: 78E, Lon_max: 100 E 20 Temporal Extent April 2015-June 2023 21 Access Rights or Restrictions Open Access 22 Distribution Information Online download of data files in netCDF format 23 Processing Level Level 4 4 Reference System Datum: WGS84 Tags: Opendata Ocean", "source_url": "https://www.mosdac.gov.in/high-resolution-sea-surface-salinity", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "ocean", "climate", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.113594"}}
{"title": "MOSDAC Live", "type": "general", "section": "Ocean Monitoring", "text": "X Enter Keyword Search {{entry.display_name}} ({{entry.type}}) {{layer.dateval}} {{layer.timeval}} {{layer.sensor}}/{{layer.satellite}} {{layer.name}} {{layer.dateval_local}} {{layer.timeval_local}} {{layer.sensor}}/{{layer.satellite}} {{layer.name}} {{timezone}} 3D X -- Overlay Layers {{layer.displayname}} {{layer.aws_parameter.parameter_name}} {{layer.dateval_gmt}} {{layer.timeval_gmt}} {{layer.dateval_local}} {{layer.timeval_local}} {{overlaylayer.displayname}} Layers {{layer.name.substring(0,25)}} {{layer.dateval}} {{layer.timeval}} {{layer.dateval_local}} {{layer.timeval_local}} {{layer.sensor}}/{{layer.satellite}} Elevation :- Range: From: To: Default Apply Previous Event: Date: TIME: Base Layer {{layer.displayname}} {{layer.sensor}}/{{layer.satellite}} {{baselayer.displayname}} {{item.label}} {{slider_button_text}} Quick Layers Tools Animation Analysis Legends MOSDAC-LIVE is a web enabled data and Information visualization and analysis system of MOSDAC, SAC/ISRO. LIVE provides access to Satellite Data Products and Information products derived from Satellite and model forecast in near real time basis. The information contained in this website is currently a Beta site under development. Some of the information, layers may not have been completely validated. This information is to be used along with other reliable data sources for interpretation and derivation of weather and oceanographic events. The information is provided on best effort basis and while we endeavor to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the absolute accuracies of information, data products, services, or related graphics contained on the website for any purpose unless and until explicitly mentioned. In no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website. The maps are only for gross indication of locations. Every effort is made to keep the website up and running smoothly. However, we take no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control. Contact: admin mosdac.gov.in Credits for following information/layers/data used in this website is dually acknowledged Bhuvan Layer: NRSC, Hyderabd (www.nrsc.gov.in) Cartodem and LISS-3 Mosaic: Bhuvan, NRSC, Hyderabd (www.nrsc.gov.in) OpenStreetMap: OpenStreetMap Contributors (www.openstreetmap.org/copyright) True Marble: Unearthed Outdoors, LLC Satellite Data Layers : Indian Space Research Organisation (ISRO) India River Basins/ State/ District Boundaries and World Coastlines : India Meteorological Department, Delhi (www.imd.gov.in) Data Server: THREDDS 4.3 (www.unidata.ucar.edu/software/thredds) Nowcast Data : AOSG/SAC Forecast Data: AOSG/SAC Close {{selected_list_id}} Add Layer Close PLevel max: PLevel min: PLevel: Double click/touch on timeseries graph to default zoom Close Close {{item.label}} {{view_configuration[2].params.title}} {{togglemenu}} X", "source_url": "https://www.mosdac.gov.in/internal/ocean", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "ocean", "climate", "imagery", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.117990"}}
{"title": "In-situ Catalog", "type": "general", "section": "General", "text": "A- A A यथ स थ त (AWS) उत प द स च Insitu (AWS) Catalog Satellite: {{satellite.name}} Sensor: {{sensor.name}} X Sr.No Station Name State Station ID Station Key Latitude Longitude Start Date End Date Processing Status Temporal Resolution {{ index 1}} {{allproduct.name}} {{allproduct.state}} {{allproduct.id}} {{allproduct.key}} {{allproduct.latres}} {{allproduct.longres}} {{allproduct.startdate}} {{allproduct.enddate}} {{allproduct.actv}} {{allproduct.actv}} {{allproduct.frequency}} Feedback About Us Contact Us Copyright Policy Data Access Policy Hyperlink Policy Privacy Policy Website Policies Terms Conditions FAQs Ver 3.0; Last reviewed and updated on 22 Aug, 2024", "source_url": "https://www.mosdac.gov.in/internal/catalog-insitu", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.120339"}}
{"title": "RSS Feed Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Uses RSS (Rich Site Summary) based technology for dissemination of Satellite Images and Data Products to end users on Internet Allow Users to subscribe to these feeds automatically and get notified for availability of new data sets Feed subscription is supported by Standard browsers and on RSS readers available on Mobile Apps Enhanced Features specific to Satellite Data are Planned in Customized Client, supporting automated download, analysis and visualization of data Currently SCATSAT-1 High Resolution Products are available, soon more products are planned to be added. Access the feeds using below links: SCATSAT-1 Feed : https://mosdac.gov.in/isrocast.xml INSAT3D-Imager Feed : https://mosdac.gov.in/3dimager.xml INSAT3D-Sounder Feed : https://mosdac.gov.in/3dsounder.xml INSAT3DR-Imager Feed : https://mosdac.gov.in/3drimager.xml INSAT3DR-Sounder Feed : https://mosdac.gov.in/3drsounder.xml", "source_url": "https://www.mosdac.gov.in/rss-feed", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "imagery", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.425124"}}
{"title": "Website Policies Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Content Archival Policy The content components are created with metadata, source and validity date. There would be some content which is permanent in nature and for such content it is assumed that the content would be reviewed in every ten years unless it is edited / deleted based on requirement. The content shall not be displayed on the Website after the validity date. The content components like documents, reports is regularly reviewed as per the Content Review Policy. The content is reviewed at least two weeks prior to the validity date and if required content will be revalidated and validity date is modified. If content is not relevant, then the content is archived and no longer published on the Website. The above mentioned policy in force and will be followed while maintaining the website. Content Contribution, Moderation and Approval Policy Content would be contributed by the authorized Content Manager in a consistent fashion to maintain uniformity and to bring in standardization along with associated metadata and keywords. In order to present the content as per the requirement of the viewer, organize the content in categorized manner and to retrieve the relevant content efficiently, the content is contributed to the website through a Content Management System which would be web-based having user-friendly interface. The content on the website goes through the entire life-cycle process of:- Creation, Modification, Approval, Moderation, Publishing, Expiry Once the content is contributed it is approved and moderated prior to being published on the Website. If the content is rejected at any level then it is reverted back to the originator of the content for modification. \"MOSDAC\" has prescribed the appropriate Moderator Approver for each of the content element. Content Review Policy All possible efforts need to be taken to keep the content on the Website current and up-to-date. This Content Review Policy defines the roles and responsibilities of the website content review and the manner in which it needs to be carried out. Review Policies are defined for the diverse content elements. The Review Policy is based on different type of content elements, its validity and relevance as well as the archival policy. The entire website content would be reviewed for syntax checks once a month by the \"MOSDAC\" Team. Website Contingency Management Policy The presence of the website on the Internet and very importantly the site is fully functional all the times. It is expected of the Government websites to deliver information and services on a 24X7 basis. Hence, all efforts should be made to minimize the downtime of the website as far as possible. It is therefore necessary that a proper Contingency Plan to be prepared in handle any eventualities and restore the site in the shortest possible time. The possible contingencies include: 1. Defacement of the website: All possible security measures must be taken for the website to prevent any possible defacement/hacking by unscrupulous elements. However, if despite the security measures in place, such an eventuality occurs, there must be a proper contingency plan, which should immediately come into force. If it has been established beyond doubt that the website has been defaced, the site must be immediately blocked. The contingency plan must clearly indicate as to who is the person authorised to decide on the further course of action in such eventualities. The complete contact details of this authorised person must be available at all times with the web management team. Efforts should be made to restore the original site in the shortest possible time. At the same time, regular security reviews and checks should be conducted in order to plug any loopholes in the security. 2. Data Corruption : A proper mechanism has to be worked out by the concerned in consultation with their web hosting service provider to ensure that appropriate and regular back-ups of the website data are being taken. These enable a fast recovery and uninterrupted availability of the information to the citizens in view of any data corruption. 3. Hardware/Software Crash: Though such an occurrence is a rarely, still in case the server on which the website is being hosted crashes due to some unforeseen reason, the web hosting service provider must have enough redundant infrastructure available to restore the website at the earliest. 4. Natural Disasters : There could be circumstances whereby due to some natural calamity, the entire data center where the website is being hosted gets destroyed or ceases to exist. A well planned contingency mechanism has to be in place for such eventualities whereby is should be ensured that the Hosting Service Provider has a 'Disaster Recover Centre (DRC)' set up at a geographically remote location and the website is switched over to the DRC with minimum delay and restored on the Net. 5 . Apart from the above, in the event of any National Crisis or unforeseen calamity, Government websites are looked upon as a reliable and fast source of information to the public. A well defined contingency plan for all such eventualities must be in place so that the emergency information/contact help-lines could be displayed on the website without any delay. For this, the concerned person in the MOSDAC responsible for publishing such emergency information must be identified and the complete contact details should be available at all times. Website Monitoring Policy \"MOSDAC\" has a Website Monitoring Policy in place and the website is monitored periodically to address and fix the quality and compatibility issues around the following parameters: Performance : Site download time is optimized for a variety of network connections as well as devices. All important pages of the website are tested for this. Functionality : All modules of the website are tested for their functionality. The interactive components of the site such as, feedback forms are working smoothly. Broken Links: The website is thoroughly reviewed to rule out the presence of any broken links or errors. Traffic Analysis : The site traffic is regularly monitored to analyse the usage patterns as well as visitors' profile and preferences. Feedback: Feedback from the visitors is the best way to judge a website's performance and make necessary improvements. A proper mechanism for feedback is in place to carry out the changes and enhancements as suggested by the visitors. Website Security Policy \"MOSDAC\" website contains information which is freely accessible, and may be viewed by any visitor. However, the website maintains a copyright interest in the contents of all of its websites. Except for authorized security investigations and data collection, no attempts will be made to identify individual users. Accumulated data logs will be scheduled for regular deletion. The Website Privacy Policy details our position regarding the use of personal information provided by customers/visitors. Unauthorized attempts to upload information or change information are strictly prohibited, and may be punishable under the Information Technology Act, 2000. User ID and Password Policy Access to sensitive or proprietary business information on \"MOSDAC\" websites is limited to users who have been determined to have an appropriate official reason for having access to such data. All registered users who are granted security access will be identified by a user name provided by webmaster. Users who are granted password access to restricted information are prohibited from sharing those passwords with or divulging those passwords to any third parties. User will notify us immediately in the event a User ID or password is lost or stolen or if User believes that a non-authorized individual has discovered the User ID or password. If you have any questions or comments regarding \"MOSDAC\" Website Security Policy, please contact the Web Information Manager.", "source_url": "https://www.mosdac.gov.in/website-policies", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "ocean", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.435960"}}
{"title": "METEOSAT8 Cloud Properties Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "NASA LaRC is operationally generating global cloud properties products using different geostationary satellites. This Metosat-8 cloud properties products include Cloud Phase, Optical Depth, Effective Water Radius, Effective Ice Diameter, Liquid Water Path, Ice Water Path, Effective Cloud Temperature, Cloud Top Height, Effective Cloud Height, Cloud Base Height, Cloud Top Pressure, Effective Cloud Pressure, Cloud Base Pressure, Broadband Albedo, Broadband Longwave Flux, and Cloud Thickness. Data Access Click Here to access the Science Products. Request to use MOSDAC Single Sign On user credentials to download the data. Data Version Format : NetCDF (nc4) CDO Version : 1.9.3 , Conventions : CF 1.6 Data Sources Cloud Properties Products, downloaded from LaRC, NASA Processing Steps https://satcorps.larc.nasa.gov/CERES_algorithms/ References B. A. Wielicki, B. R. Barkstrom, B. A. Baum, T. P. Charlock, R. N. Green, D. P. Kratz, R. B. Lee, P. Minnis, G. L. Smith, T. Wong, D. F. Young, R. D. Cess, J. A. Coakley, D. A. H. Crommelynck, L. Donner, R. Kandel, M. D. King, A. J. Miller, V. Ramanathan, D. A. Randall, L. L. Stowe, R. M. Welch, \"Clouds and the Earth's Radiant Energy System (CERES): Algorithm overview\", IEEE Trans. Geosci. Remote Sens., vol. 36, no. 4, pp. 1127-1141, Jul. 1998. C. Kummerow, W. Barnes, T. Kozu, J. Shine, J. Simpson, \"The Tropical Rainfall Measuring Mission system (TRMM) sensor package\", J. Atmos. Ocean. Technol., vol. 15, pp. 809-827, 1998 W. L. Barnes, T. S. Pagano, V. V. Salomonson, \"Prelaunch characteristics of the moderate resolution imaging spectroradiometer (MODIS) on EOS-AM1\", IEEE Trans. Geosci. Remote Sens., vol. 36, no. 4, pp. 1088-1100, Jul. 1998 Derivation Techniques and Algorithm Minnis, Patrick Sun-Mack, Szedung F. Young, David W. Heck, Patrick Garber, Donald Chen, Yan A Spangenberg, Douglas Arduini, Robert Trepte, Qing Smith Sr, William Ayers, J Gibson, Sharon F. Miller, Walter Hong, Gang Chakrapani, Venkatesan Takano, Yoshihide Liou, Kuo-Nan Xie, Yu Yang, Ping. (2011). CERES edition-2 cloud property retrievals using TRMM VIRS and Terra and Aqua MODIS data-Part I: Algorithms. IEEE TRANSACTIONS ON GEOSCIENCE AND REMOTE SENSING. 49. 10.1109/TGRS.2011.2144601. Limitations Refer Paper Known problems with data Data will be available with delay File Naming Convention Following file naming convention are followed: NetCDF File Name (NetCDFFileName): M8SEV_DDMMMYYYY_HHMM_L2B_CP_IND_V04.0.nc Parameter Chip File Name : NetCDFFilename_CloudParamName(4 Char).jpg File Nomenclature Details: SatIdSensorId_AcquisitionDateTime_ProcessingLevel_ProductName_ProductRegion_Version.nc SatId (2 Char) M8 SensorId ( 3 Char) SEV (SEVIRI sensor) AcquisitionDateTime (14 Char) DDMMMYYYY_HHMM ProcessingLevel (3 Char) L2B ProductName (2 Char) CP (Cloud Properties) ProductRegion ( 3 Char) IND (Indian Region) Version (5 Char) V04.0 (Product Version Number) MetaData Sr. No Core Metadata Elements Definition 1 Metadata language English 2 Metadata Contact Sazid Mahammad, MRG/EPSA, Space Applications Centre (ISRO), Ahmedabad-380015, India. Email: sazid sac.isro.gov.in 3 Metadata date May 14, 2018 4 Data Lineage or Quality Depends on Metosat 8 products, some times some data gaps may be observed 5 Title Cloud Properties Products from Meteosat-8 over Indian Peninsula 6 Abstract NASA LaRC is operationally generating global cloud properties products using different geostationary satellites. This Metosat-8 cloud properties products include Cloud Phase, Optical Depth, Effective Water Radius, Effective Ice Diameter, Liquid Water Path, Ice Water Path, Effective Cloud Temperature, Cloud Top Height, Effective Cloud Height, Cloud Base Height, Cloud Top Pressure, Effective Cloud Pressure, Cloud Base Pressure, Broadband Albedo, Broadband Longwave Flux, and Cloud Thickness. 7 Dataset Contact Sazid Mahammad, MRG/EPSA, Space Applications Centre (ISRO), Ahmedabad-380015, India. Email: sazid sac.isro.gov.in 8 Update frequency 1 hour 9 Access Rights or Restriction Open Access 10 Spatial Resolution 6 Km (Nominal) 11 Language English 12 Topic Category Atmospheric Science 13 Keywords Cloud Properties, Climate, cloud, cloud remote sensing, Clouds and the Earth's Radiant Energy System (CERES), 14 Date or period From 01-May-2018 onwards 15 Responsible Party EPSA/SAC, ISRO and LaRC, NASA 16 Organization Space Applications Centre (ISRO), Ahmedabad, India and Langley Research Centre (NASA), Hampton, VA, USA 16a Org. role SAC: Extraction of Indian region and generation of chips LaRC: Generation of Cloud Properties product 16b Individual name Sazid Mahammad, MRG/EPSA, Space Applications Centre (ISRO), Ahmedabad-380015, India. Email: sazid sac.isro.gov.in 16c Position Scientist/Engineer, MRG/EPSA, SAC (ISRO), Ahmedabad-380015, India. Email: sazid sac.isro.gov.in 16d Vertical Extent (minimumValue, maximumValue, unitOfMeasure, vertical datum) Cloud top Properties 17 Geographic Extent UL Coordinates: 38 N, 65 E. UR Coordinates: 38 S, 97.5 E. LL Coordinates: 5.5 N, 65 E. LR Coordinates: 5.5 S, 97.5 E 18 Geographic name, geographic Identifier Indian Peninsula 19 Bounding box UL Coordinates: 38 N, 65 E. UR Coordinates: 38 S, 97.5 E. LL Coordinates: 5.5 N, 65 E. LR Coordinates: 5.5 S, 97.5 E Number of Rows i.e. Image Height: 524 Number of Columns i.e. Image Width : 489 20 Temporal Extent Hourly Product with Given date, time in GMT 21 Access Rights or Restrictions Open Access 22 Distribution Information Online download of data files in NetCDF format and images in jpg format 23 Processing Level Level 2 (Data product derived from Metosat-8) 24 Reference System Projection: Geographic Latitude,Longitude; Datum: WGS84 Tags: Opendata Atmosphere", "source_url": "https://www.mosdac.gov.in/meteosat8-cloud-properties", "document_type": "static", "meta": {"tags": ["rainfall", "temperature", "satellite", "ocean", "climate", "imagery", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.443983"}}
{"title": "Imageshow Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Your browser does not support iframes, but you can use the following link. Link Fullscreen", "source_url": "https://www.mosdac.gov.in/imageshow", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "imagery", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.445061"}}
{"title": "Alerts Forewarning", "type": "general", "section": "General", "text": "You need to enable JavaScript to run this app.", "source_url": "https://www.mosdac.gov.in/internal/state", "document_type": "static", "meta": {"tags": [], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.446752"}}
{"title": "Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Your browser does not support iframes, but you can use the following link. Link Fullscreen", "source_url": "https://www.mosdac.gov.in/node?qt-services_quicktab=0#qt-services_quicktab", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.447802"}}
{"title": "Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Your browser does not support iframes, but you can use the following link. Link Fullscreen", "source_url": "https://www.mosdac.gov.in/node?qt-services_quicktab=5#qt-services_quicktab", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.448839"}}
{"title": "INSAT-3D Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "INSAT or the Indian National Satellite System is a series of multipurpose Geo-stationary satellites launched by ISRO to satisfy the telecommunications, broadcasting, meteorology, and search and rescue needs of India. Commissioned in 1983, INSAT is the largest domestic communication system in the Asia Pacific Region. The satellite is monitored and controlled by Master Control Facilities that exist in Hassan and Bhopal. INSAT-3D is a multipurpose geosynchronous spacecraft with main meteorological payloads (imager and sounder). The main objectives for this mission are to provide an operational, environmental and storm warning system to protect life and property. INSAT3D is monitoring the earth's surface, oceanic observations and also provide data dissemination capabilities. It provides Broadcast Satellite Services (BSS) through two S-band transponders. The data acquisition and processing system is established at Space Applications Centre, Bopal Campus, Ahmedabad, India. The processing of INSAT-3D data is taken place broadly in four steps. Ground receiving system to receive data Data Reception (DR) system to generate raw data (L0) files Data Processing (DP) system to process L0 data and produce L1B data files (Calibrated and Geo located) Product generation and Dissemination system ह न द", "source_url": "https://www.mosdac.gov.in/insat-3d", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "imagery", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.452174"}}
{"title": "MOSDAC Live", "type": "general", "section": "General", "text": "X Enter Keyword Search {{entry.display_name}} ({{entry.type}}) {{layer.dateval}} {{layer.timeval}} {{layer.sensor}}/{{layer.satellite}} {{layer.name}} {{layer.dateval_local}} {{layer.timeval_local}} {{layer.sensor}}/{{layer.satellite}} {{layer.name}} {{timezone}} 3D X -- Overlay Layers {{layer.displayname}} {{layer.aws_parameter.parameter_name}} {{layer.dateval_gmt}} {{layer.timeval_gmt}} {{layer.dateval_local}} {{layer.timeval_local}} {{overlaylayer.displayname}} Layers {{layer.name.substring(0,25)}} {{layer.dateval}} {{layer.timeval}} {{layer.dateval_local}} {{layer.timeval_local}} {{layer.sensor}}/{{layer.satellite}} Elevation :- Range: From: To: Default Apply Previous Event: Date: TIME: Base Layer {{layer.displayname}} {{layer.sensor}}/{{layer.satellite}} {{baselayer.displayname}} {{item.label}} {{slider_button_text}} Quick Layers Tools Animation Analysis Legends MOSDAC-LIVE is a web enabled data and Information visualization and analysis system of MOSDAC, SAC/ISRO. LIVE provides access to Satellite Data Products and Information products derived from Satellite and model forecast in near real time basis. The information contained in this website is currently a Beta site under development. Some of the information, layers may not have been completely validated. This information is to be used along with other reliable data sources for interpretation and derivation of weather and oceanographic events. The information is provided on best effort basis and while we endeavor to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the absolute accuracies of information, data products, services, or related graphics contained on the website for any purpose unless and until explicitly mentioned. In no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website. The maps are only for gross indication of locations. Every effort is made to keep the website up and running smoothly. However, we take no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control. Contact: admin mosdac.gov.in Credits for following information/layers/data used in this website is dually acknowledged Bhuvan Layer: NRSC, Hyderabd (www.nrsc.gov.in) Cartodem and LISS-3 Mosaic: Bhuvan, NRSC, Hyderabd (www.nrsc.gov.in) OpenStreetMap: OpenStreetMap Contributors (www.openstreetmap.org/copyright) True Marble: Unearthed Outdoors, LLC Satellite Data Layers : Indian Space Research Organisation (ISRO) India River Basins/ State/ District Boundaries and World Coastlines : India Meteorological Department, Delhi (www.imd.gov.in) Data Server: THREDDS 4.3 (www.unidata.ucar.edu/software/thredds) Nowcast Data : AOSG/SAC Forecast Data: AOSG/SAC Close {{selected_list_id}} Add Layer Close PLevel max: PLevel min: PLevel: Double click/touch on timeseries graph to default zoom Close Close {{item.label}} {{view_configuration[2].params.title}} {{togglemenu}} X", "source_url": "https://www.mosdac.gov.in/internal/urja", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "ocean", "climate", "imagery", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.456751"}}
{"title": "Alerts Forewarning", "type": "general", "section": "Ocean Monitoring", "text": "You need to enable JavaScript to run this app.", "source_url": "https://www.mosdac.gov.in/internal/afs-seac", "document_type": "static", "meta": {"tags": [], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.458438"}}
{"title": "Radar Catalog", "type": "general", "section": "General", "text": "A- A A र ड र उत प द स च RADAR Catalog Satellite: {{satellite.name}} Sensor: {{sensor.name}} X Sr.No Product / Acq Calendar Product Description Processing Level Temporal Resolution Start Date End Date Processing Status DOI {{ index 1}} {{allproduct.name}} {{allproduct.description}} {{allproduct.processlevel}} {{allproduct.frequency uppercase}} {{allproduct.startdate}} {{allproduct.enddate}} {{allproduct.actv}} {{allproduct.actv}} {{allproduct.techdoc}} Feedback About Us Contact Us Copyright Policy Data Access Policy Hyperlink Policy Privacy Policy Website Policies Terms Conditions FAQs Ver 3.0; Last reviewed and updated on 22 Aug, 2024", "source_url": "https://www.mosdac.gov.in/internal/catalog-radar", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.461152"}}
{"title": "Validation Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Display name modified Satellite Thu, 2018-02-08 10:35 Forecast Wed, 2017-01-04 09:46 2 folders", "source_url": "https://www.mosdac.gov.in/validation-reports", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.462390"}}
{"title": "Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Your browser does not support iframes, but you can use the following link. Link Fullscreen", "source_url": "https://www.mosdac.gov.in/node?qt-services_quicktab=3#qt-services_quicktab", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.463432"}}
{"title": "Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Your browser does not support iframes, but you can use the following link. Link Fullscreen", "source_url": "https://www.mosdac.gov.in/node?qt-services_quicktab=2#qt-services_quicktab", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.464479"}}
{"title": "MOSDAC Live", "type": "general", "section": "General", "text": "X Enter Keyword Search {{entry.display_name}} ({{entry.type}}) {{layer.dateval}} {{layer.timeval}} {{layer.sensor}}/{{layer.satellite}} {{layer.name}} {{layer.dateval_local}} {{layer.timeval_local}} {{layer.sensor}}/{{layer.satellite}} {{layer.name}} {{timezone}} 3D X -- Overlay Layers {{layer.displayname}} {{layer.aws_parameter.parameter_name}} {{layer.dateval_gmt}} {{layer.timeval_gmt}} {{layer.dateval_local}} {{layer.timeval_local}} {{overlaylayer.displayname}} Layers {{layer.name.substring(0,25)}} {{layer.dateval}} {{layer.timeval}} {{layer.dateval_local}} {{layer.timeval_local}} {{layer.sensor}}/{{layer.satellite}} Elevation :- Range: From: To: Default Apply Previous Event: Date: TIME: Base Layer {{layer.displayname}} {{layer.sensor}}/{{layer.satellite}} {{baselayer.displayname}} {{item.label}} {{slider_button_text}} Quick Layers Tools Animation Analysis Legends MOSDAC-LIVE is a web enabled data and Information visualization and analysis system of MOSDAC, SAC/ISRO. LIVE provides access to Satellite Data Products and Information products derived from Satellite and model forecast in near real time basis. The information contained in this website is currently a Beta site under development. Some of the information, layers may not have been completely validated. This information is to be used along with other reliable data sources for interpretation and derivation of weather and oceanographic events. The information is provided on best effort basis and while we endeavor to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the absolute accuracies of information, data products, services, or related graphics contained on the website for any purpose unless and until explicitly mentioned. In no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website. The maps are only for gross indication of locations. Every effort is made to keep the website up and running smoothly. However, we take no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control. Contact: admin mosdac.gov.in Credits for following information/layers/data used in this website is dually acknowledged Bhuvan Layer: NRSC, Hyderabd (www.nrsc.gov.in) Cartodem and LISS-3 Mosaic: Bhuvan, NRSC, Hyderabd (www.nrsc.gov.in) OpenStreetMap: OpenStreetMap Contributors (www.openstreetmap.org/copyright) True Marble: Unearthed Outdoors, LLC Satellite Data Layers : Indian Space Research Organisation (ISRO) India River Basins/ State/ District Boundaries and World Coastlines : India Meteorological Department, Delhi (www.imd.gov.in) Data Server: THREDDS 4.3 (www.unidata.ucar.edu/software/thredds) Nowcast Data : AOSG/SAC Forecast Data: AOSG/SAC Close {{selected_list_id}} Add Layer Close PLevel max: PLevel min: PLevel: Double click/touch on timeseries graph to default zoom Close Close {{item.label}} {{view_configuration[2].params.title}} {{togglemenu}} X", "source_url": "https://www.mosdac.gov.in/internal/varsha", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "ocean", "climate", "imagery", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.468834"}}
{"title": "Data Quality Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Display name modified SCATSAT1 Thu, 2017-04-06 15:31 INSAT-3DR Mon, 2017-03-27 11:18 INSAT-3D Mon, 2017-03-27 11:18 3 folders", "source_url": "https://www.mosdac.gov.in/data-quality", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.470217"}}
{"title": "MOSDAC Live", "type": "general", "section": "General", "text": "X Enter Keyword Search {{entry.display_name}} ({{entry.type}}) {{layer.dateval}} {{layer.timeval}} {{layer.sensor}}/{{layer.satellite}} {{layer.name}} {{layer.dateval_local}} {{layer.timeval_local}} {{layer.sensor}}/{{layer.satellite}} {{layer.name}} {{timezone}} 3D X -- Overlay Layers {{layer.displayname}} {{layer.aws_parameter.parameter_name}} {{layer.dateval_gmt}} {{layer.timeval_gmt}} {{layer.dateval_local}} {{layer.timeval_local}} {{overlaylayer.displayname}} Layers {{layer.name.substring(0,25)}} {{layer.dateval}} {{layer.timeval}} {{layer.dateval_local}} {{layer.timeval_local}} {{layer.sensor}}/{{layer.satellite}} Elevation :- Range: From: To: Default Apply Previous Event: Date: TIME: Base Layer {{layer.displayname}} {{layer.sensor}}/{{layer.satellite}} {{baselayer.displayname}} {{item.label}} {{slider_button_text}} Quick Layers Tools Animation Analysis Legends MOSDAC-LIVE is a web enabled data and Information visualization and analysis system of MOSDAC, SAC/ISRO. LIVE provides access to Satellite Data Products and Information products derived from Satellite and model forecast in near real time basis. The information contained in this website is currently a Beta site under development. Some of the information, layers may not have been completely validated. This information is to be used along with other reliable data sources for interpretation and derivation of weather and oceanographic events. The information is provided on best effort basis and while we endeavor to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the absolute accuracies of information, data products, services, or related graphics contained on the website for any purpose unless and until explicitly mentioned. In no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website. The maps are only for gross indication of locations. Every effort is made to keep the website up and running smoothly. However, we take no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control. Contact: admin mosdac.gov.in Credits for following information/layers/data used in this website is dually acknowledged Bhuvan Layer: NRSC, Hyderabd (www.nrsc.gov.in) Cartodem and LISS-3 Mosaic: Bhuvan, NRSC, Hyderabd (www.nrsc.gov.in) OpenStreetMap: OpenStreetMap Contributors (www.openstreetmap.org/copyright) True Marble: Unearthed Outdoors, LLC Satellite Data Layers : Indian Space Research Organisation (ISRO) India River Basins/ State/ District Boundaries and World Coastlines : India Meteorological Department, Delhi (www.imd.gov.in) Data Server: THREDDS 4.3 (www.unidata.ucar.edu/software/thredds) Nowcast Data : AOSG/SAC Forecast Data: AOSG/SAC Close {{selected_list_id}} Add Layer Close PLevel max: PLevel min: PLevel: Double click/touch on timeseries graph to default zoom Close Close {{item.label}} {{view_configuration[2].params.title}} {{togglemenu}} X", "source_url": "https://www.mosdac.gov.in/internal/vayu", "document_type": "static", "meta": {"tags": ["temperature", "satellite", "ocean", "climate", "imagery", "data", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.474565"}}
{"title": "", "type": "general", "section": "General", "text": "{{appName}} {{start_date date:'yyyy-MM-dd'}} To {{end_date date:'yyyy-MM-dd' }} Data Available from Jan-1993 to Dec-2024 Start date End date Select Eddy Type: Cyclonic Anti-Cyclonic Both Submit Animation Select Eddy ID: Close Animation Play Replay Legends Eddy for more detail: Eddy Detection and Tracking Developed Maintained By: DWD/SAC Overlay Layers Source: NRDB Ports data source: http://msi.ngs.mil Credits for following information/layers/data used in this website is dually acknowledged Bhuvan Layer: NRSC, Hyderabd (www.nrsc.gov.in) OpenStreetMap: OpenStreetMap Contributors (www.openstreetmap.org/copyright) Satellite Data Layers : Indian Space Research Organisation (ISRO) True Marble: Unearthed Outdoors, LLC India River Basins/ State/ District Boundaries and World Coastlines : India Meteorological Department, Delhi (www.imd.gov.in) Credits for following information/layers/data used in this website is dually acknowledged: Input altimeter currents data: Near Real Time data provided by E.U. Copernicus Marine Service Information; https://doi.org/10.48670/moi-00149 Close", "source_url": "https://www.mosdac.gov.in/internal/eddy", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.476715"}}
{"title": "Copyright Policy Meteorological Oceanographic Satellite Data Archival Centre", "type": "general", "section": "Satellite Data", "text": "Material featured on this site may be reproduced free of charge in any format or media without requiring specific permission. This is subject to the material being reproduced accurately and not being used in a derogatory manner or in a misleading context. Where the material is being published or issued to others, the source must be prominently acknowledged. However, the permission to reproduce this material does not extend to any material on this site, which is explicitly identified as being copyright of a third party as well as to materials contained in the hyperlinked sites. Authorization to reproduce such material must be obtained from the copyright holders concerned. ह न द", "source_url": "https://www.mosdac.gov.in/copyright-policy", "document_type": "static", "meta": {"tags": ["satellite", "ocean", "data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.478170"}}
{"title": "sftp-mosdac_0", "type": "documentation", "section": "Products", "text": "User Guide for data downloading from MOSDAC MOSDAC has upgraded its file transfer services from FTP to Secure FTP (SFTP) Important information : - The user credentials for accessing the SFTP server are the same as FTP. - In case of any clarification or any issues, please contact MOSDAC Administrator (admin mosdac.gov.in) Steps for automatic download through script : (One can lftp for downloading the data from MOSDAC using sftp protocol) Example script for download using lftp on linux : -------------------------------------------------------------------------------------------------- HOST 'sftp://download.mosdac.gov.in' USER username' PASSWORD 'password' REMOTE_DIR '/Order' LOCAL_DIR 'local directory path' lftp -u \" USER\",\" PASSWORD\" HOST EOF set ftp:ssl-force true set ssl:verify-certificate no mirror --use-pget-n 10 REMOTE_DIR LOCAL_DIR; exit EOF --------------------------------------------------------------------------------------------------------- Steps to access SFTP services using ftp download clients: - User can access the SFTP service through any SFTP client such as WinSCP, FileZilla etc as follows : o Host name : download.mosdac.gov.in o Select File transfer protocol as SFTP and Port no, 22 o Type the username and password (same as MOSDAC user credentials) and click on login or connect. You will be able to access your ordered data under the \"Order\" directory. - FileZilla Client example : WincSCP Client example :", "source_url": "mosdac_data/raw_docs/sftp-mosdac_0.pdf", "document_type": "pdf", "meta": {"tags": ["data"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.480712"}}
{"title": "Onset 20Prediction 202023", "type": "documentation", "section": "Products", "text": "Study of Monsoon Onset over Kerala during 2023 using satellite observations Peak of TPW: Region: 50 E:65 E 0 N:10 N 11 May 2023 Prediction of Onset: 29 May 2023 (after 18 days from peak of TPW, 4 days) Formation of MJO over Equatorial Indian Ocean during pre-monsoon 2023 Pentad Wind at 850 hPa during pre-monsoon month of 2023 The wind reversal over equator can be seen and the westerly wind got stronger after the peak TPW achieved. Conclusion A peak of TPW over the Arabian Sea (50 E:65 E; 0 N:10 N) is occurred 18 days prior to Onset at Kerala. MJO start forming at the same time over equatorial Indian Ocean. The monsoon wind (wind reversal over equator and strong westerly wind) over Arabian Sea into Indian landmass started after the peak of TPW observed. The Onset process get disturbed if cyclone formed during the said period (a case of 2021). The present analysis lead to the conclusion that the Onset may occurred on 29 May 2023 with a error of 4 days. Due to the cyclone present in Bay of Bengal, we would like to observe the situation for another couple of days before giving the final prediction. Thank You", "source_url": "mosdac_data/raw_docs/Onset%20Prediction%202023.pdf", "document_type": "pdf", "meta": {"tags": ["satellite", "ocean", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.488022"}}
{"title": "Onset 20Prediction 202024", "type": "documentation", "section": "Products", "text": "Study of Monsoon Onset over Kerala during 2024 using satellite observations Peak of TPW: Region: 50 E:65 E 16 May 2024 0 N:10 N Prediction of Onset: 03 June 2024 (after 18 days from peak of TPW, 4 days) Pentad Wind at 850 hPa during pre-monsoon month of 2024 The wind reversal over equator yet to occur and the westerly wind got stronger after the peak TPW achieved. Conclusion A peak of TPW over the Arabian Sea (50 E:65 E; 0 N:10 N) is occurred 18 days prior to Onset at Kerala. MJO start forming at the same time over equatorial Indian Ocean. The monsoon wind (wind reversal over equator and strong westerly wind) over Arabian Sea into Indian landmass started after the peak of TPW observed. The present analysis lead to the conclusion that the Onset may occurred on 03 June 2024 with a error of 4 days. We may like to update our prediction if any cyclonic condition occur over Bay of Bengal.", "source_url": "mosdac_data/raw_docs/Onset%20Prediction%202024.pdf", "document_type": "pdf", "meta": {"tags": ["satellite", "ocean", "monitoring"], "geolocation": "India", "processed_at": "2025-07-04T21:26:53.489967"}}
